In [40]:
import pandas as pd
import numpy as np
np.random.seed(0)
train = pd.read_csv("train.csv")
train = train.drop(['Cabin'],axis=1,inplace=False)
train = train.dropna()
y = train['Survived']
train.drop(['Survived','PassengerId','Name','Ticket'],axis=1,inplace=True)
x = pd.get_dummies(train)

In [41]:
##observe whats going on
print("x_data_sample")
display(x.head(5))
print("y_data_sample")
display(y.head(5))

x_data_sample

,Pclass,Age,SibSp,Parch,Fare,Sex_female,Sex_male,Embarked_C,Embarked_Q,Embarked_S
0,3,22.0,1,0,7.2500,0,1,0,0,1
1,1,38.0,1,0,71.2833,1,0,1,0,0
2,3,26.0,0,0,7.9250,1,0,0,0,1
3,1,35.0,1,0,53.1000,1,0,0,0,1
4,3,35.0,0,0,8.0500,0,1,0,0,1

y_data_sample

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [42]:
from sklearn import tree
dtc=tree.DecisionTreeClassifier()
dtc.fit(x,y)

DecisionTreeClassifier()

In [43]:
test=pd.read_csv("test.csv")
ids=test[['PassengerId']]
test.drop(['PassengerId','Name','Ticket','Cabin'],axis=1,inplace=True)
test.fillna(2,inplace=True)
test=pd.get_dummies(test)

In [44]:
test.sample(5)

,Pclass,Age,SibSp,Parch,Fare,Sex_female,Sex_male,Embarked_C,Embarked_Q,Embarked_S
247,2,42.0,1,1,32.5000,0,1,0,0,1
191,1,2.0,0,0,26.0000,0,1,0,0,1
21,3,9.0,0,1,3.1708,0,1,0,0,1
179,1,64.0,0,2,83.1583,1,0,1,0,0
153,3,36.0,0,2,12.1833,1,0,0,0,1

In [45]:
predictions=dtc.predict(test)

In [46]:
result=ids.assign(Survived=predictions)
result.to_csv("titanic-result.csv",index=False)

In [47]:
result = pd.read_csv("titanic-result.csv")
result.head(5)

   PassengerId  Survived
0          892         0
1          893         0
2          894         1
3          895         1
4          896         0